Repository: tuxslack/xdeb
Catalog: usr/share/locale/*/LC_MESSAGES/xdeb.po
Languages: pt_br

source: Unable to sync shlibs.
pt_br: Não foi possível sincronizar shlibs.

source: Synced shlibs
pt_br: Shlibs sincronizadas

source: Unable to find dependency for %s, trying lazy
pt_br: Não foi possível encontrar a dependência para %s, tentando usar o lazy

source: Unable to find dependency for %s
pt_br: Não foi possível encontrar a dependência para %s

source: Moved conflict '%s' -> '%s'
pt_br: Conflito movido '%s' -> '%s'

source: Executable '%s' from package '%s' not found.
pt_br: Executável '%s' do pacote '%s' não encontrado.

source: usage
pt_br: uso

source: FILE
pt_br: ARQUIVO

source: Automatic dependency resolution
pt_br: Resolução automática de dependências

source: Download shlibs file for automatic dependencies
pt_br: Baixar o arquivo shlibs para dependências automáticas

source: Like -C, excluding shlibs and binpkgs
pt_br: Como -C, excluindo shlibs e binpkgs

source: Remove repodata file (Use for re-building)
pt_br: Remover arquivo repodata (Usar para reconstruir)

source: Do not register package in repository pool.
pt_br: Não registrar pacote no pool de repositórios.

source: Extract .deb into destdir only, do not build
pt_br: Extrair .deb apenas para o diretório dest, não compilar

source: Remove all files created by this script
pt_br: Remover todos os arquivos criados por este script

source: Build from destdir directly without a .deb file
pt_br: Compilar diretamente do diretório destdir, sem um arquivo .deb

source: Remove empty directories from the package
pt_br: Remover diretórios vazios do pacote

source: Add the -32bit suffix to the package name
pt_br: Adicionar o sufixo -32 bits ao nome do pacote

source: Don't warn if package could break the system
pt_br: Não avisar se o pacote pode danificar o sistema

source: Try to fix certain file conflicts (deprecated)
pt_br: Tentar corrigir certos conflitos de arquivo (obsoleto)

source: Don't try to fix certain file conflicts
pt_br: Não tentar corrigir certos conflitos de arquivo

source: Automatically install the package
pt_br: Instalar o pacote automaticamente

source: Lazy match SONAMEs
pt_br: Correspondência lenta de SONAMEs

source: Packages that shall be added as dependencies
pt_br: Pacotes que devem ser adicionados como dependências

source: Packages that shall not be used as dependencies
pt_br: Pacotes que não devem ser usados ​​como dependências

source: Package arch
pt_br: Arquitetura do pacote

source: Package name
pt_br: Nome do pacote

source: Package version
pt_br: Versão do pacote

source: Package revision
pt_br: Revisão do pacote

source: File with post-extract commands (i.e. /dev/stdin)
pt_br: Arquivo com comandos pós-extração (por exemplo, /dev/stdin)

source: Show help page
pt_br: Mostrar página de ajuda

source: example
pt_br: exemplo

source: Remove all files and quit
pt_br: Remover todos os arquivos e sair

source: Sync depdendency list and create package
pt_br: Sincronizar lista de dependências e criar pacote

source: Add tar as manual dependency and create package
pt_br: Adicionar tar como dependência manual e criar pacote

source: '%s' invalid. Use %s=... instead
pt_br: '%s' inválido. Use %s=... em vez disso

source: invalid option '%s'
pt_br: opção '%s' inválida

source: Option '-f' is now enabled by default. Use '-F' to disable it.
pt_br: A opção '-f' agora está habilitada por padrão. Use '-F' para desabilitá-la.

source: invalid option -- %s
pt_br: opção inválida -- %s

source: shlibs file not synced. Run xdeb with '-Sd' to fetch dependency file
pt_br: arquivo shlibs não sincronizado. Execute xdeb com '-Sd' para buscar o arquivo de dependência

source: Last argument is not a .deb file or does not exist
pt_br: O último argumento não é um arquivo .deb ou não existe

source: Not a valid deb file, one of the extraction steps failed
pt_br: Não é um arquivo deb válido, uma das etapas de extração falhou

source: Extracted files
pt_br: Arquivos extraídos

source: Quitting before building
pt_br: Encerrando antes de compilar

source: Neither long_desc nor short_desc provided by package
pt_br: Nem long_desc nem short_desc são fornecidos pelo pacote

source: Invalid arch: %s. Use '--arch=...' to set arch manually.
pt_br: Arquitetura inválida: %s. Use '--arch=...' para definir a arquitetura manualmente.

source: Resolved dependencies: (%s)
pt_br: Dependências resolvidas: (%s)

source: Removed empty directory %s
pt_br: Diretório vazio %s removido

source: Conflict: '%s'. Use '-e' to remove automatically.
pt_br: Conflito: '%s'. Use '-e' para remover automaticamente.

source: Conflict: '%s'
pt_br: Conflito: '%s'

source: Consider (re)moving file(s) from '%s' and run `xdeb -rb`
pt_br: Considere (re)mover o(s) arquivo(s) de '%s' e execute `xdeb -rb`

source: Errors occurred. Do not install the package on this system!
pt_br: Ocorreram erros. Não instale o pacote neste sistema!

source: Install using `xbps-install -R %s %s `
pt_br: Instalar usando `xbps-install -R %s %s `

source: musl added as dependency
pt_br: musl adicionado como dependência

source: Test if a faulty package without any files can break xdeb
pt_br: Teste se um pacote defeituoso sem nenhum arquivo pode corromper o xdeb

source: Test if removing empty directories works properly
pt_br: Teste se a remoção de diretórios vazios funciona corretamente

source: build failed
pt_br: Falha na compilação

source: file also removed
pt_br: arquivo também removido

source: dir not removed
pt_br: diretório não removido

source: xdeb failed
pt_br: xdeb falhou

source: shlibs file does not exist
pt_br: arquivo shlibs não existe

source: conflicting-with-existing-target
pt_br: conflitante-com-alvo-existente

source: old /usr/lib/dir modified
pt_br: antigo /usr/lib/dir modificado

source: /lib/dir not merged with /usr/lib/dir
pt_br: /lib/dir não mesclado com /usr/lib/dir

source: %s version: %s
pt_br: Versão do %s: %s

source: unimplemented
pt_br: não implementado

source: none
pt_br: nenhum

source: Version
pt_br: Versão

source: xdeb - Convert Debian packages (.deb) to Void Linux (.xbps)
pt_br: xdeb - Converte pacotes Debian (.deb) para Void Linux (.xbps)

source: Base directory of the packaging process
pt_br: Diretório base do processo de empacotamento

source: Function
pt_br: Função

source: Summary
pt_br: Resumo

source: Example content
pt_br: Exemplo de conteúdo

source: Temporary folder used to store files extracted directly from the .deb file, before being organized.
pt_br: Pasta temporária usada para armazenar os arquivos extraídos diretamente do .deb, antes de serem organizados.

source: This is where the .deb is initially unpacked.
pt_br: É onde o .deb é inicialmente descompactado.

source: Where the .deb package control metadata is extracted (such as control, maintainer, version, etc).
pt_br: Onde os metadados de controle do pacote .deb são extraídos (como control, maintainer, version, etc).

source: Control File Other control files (preinst, postinst, etc.)
pt_br: Arquivo control Outros arquivos de controle (preinst, postinst, etc.)

source: Directory where the actual package files are extracted (what will be installed on the system).
pt_br: Diretório onde os arquivos reais do pacote são extraídos (o que será instalado no sistema).

source: Represents the package's file system. It is the final content that will be packaged in the .xbps file.
pt_br: Representa o sistema de arquivos do pacote. É o conteúdo final que será empacotado no .xbps.

source: package-name-version
pt_br: nome-do-pacote-versao

source: Final output of the script. Contains the package that can be installed with xbps-install.
pt_br: Saída final do script. Contém o pacote que pode ser instalado com xbps-install.

source: These folders make up the structure used by the xdeb script when converting .deb packages to the native Void Linux format (.xbps). Each directory plays a specific role in the content extraction, modification, and packaging steps. Below is a description of each of them:
pt_br: Essas pastas compõem a estrutura utilizada pelo script xdeb durante a conversão de pacotes .deb para o formato nativo do Void Linux (.xbps). Cada diretório desempenha um papel específico nas etapas de extração, modificação e empacotamento do conteúdo. Abaixo está a descrição de cada uma delas:

source: General Summary: Folder What is it for? workdir Temporary workspace (raw contents of the .deb) datadir Package metadata (control, maintainer, etc.) destdir Package file system (what will be installed) binpkgs Final result: the generated .xbps package
pt_br: Resumo geral: Pasta Para que serve? workdir Área de trabalho temporária (conteúdo bruto do .deb) datadir Metadados do pacote (control, maintainer, etc) destdir Sistema de arquivos do pacote (o que será instalado) binpkgs Resultado final: o pacote .xbps gerado

source: Contains information about the package (name, version, description, etc.).
pt_br: Contém as informações sobre o pacote (nome, versão, descrição, etc).

source: Directory where the final .xbps package (from Void Linux) will be stored after creation.
pt_br: Diretório onde o pacote final .xbps (do Void Linux) será armazenado depois de criado.

source: You need to install the %s package on your system.
pt_br: Falta instalar o pacote %s no seu sistema.

source: Executable '%s' not found.
pt_br: Executável '%s' não encontrado.

source: To remove the package: sudo xbps-remove -y %s
pt_br: Para remover o pacote: sudo xbps-remove -y %s

source: Error: yad is not installed. \n\nInstall with: sudo xbps-install -Sy yad\n
pt_br: Erro: yad não está instalado. \n\nInstale com: sudo xbps-install -Sy yad\n

source: Error
pt_br: Erro

source: The xdeb script was not found.
pt_br: O script xdeb não foi localizado.

source: Converting .deb (Debian) packages to .xbps (Void Linux)
pt_br: Convertendo pacotes .deb (Debian) para .xbps (Void Linux)

source: 🧰 Welcome to the .deb to .xbps package converter! This wizard was created to make life easier for Void Linux users who want to convert Debian packages (.deb) to the format used in Void (.xbps). ✅ With this program, you can: - Convert .deb packages with or without dependencies - Download libraries (shlibs) automatically - Add dependencies manually - Perform various xdeb maintenance tasks - And much more, all with just a few clicks! 💡 Just follow the steps, choose the desired option from the menu, and select the file or directory when prompted. Click OK to continue and open the main menu.
pt_br: 🧰 Bem-vindo ao conversor de pacotes .deb para .xbps! Este assistente foi criado para facilitar a vida de usuários do Void Linux que desejam converter pacotes do Debian (.deb) para o formato utilizado no Void (.xbps). ✅ Com este programa, você pode: - Converter pacotes .deb com ou sem dependências - Baixar bibliotecas (shlibs) automaticamente - Adicionar dependências manualmente - Executar diversas tarefas de manutenção do xdeb - E muito mais, tudo com apenas alguns cliques! 💡 Basta seguir os passos, escolher a opção desejada no menu e selecionar o arquivo ou diretório quando solicitado. Clique em OK para continuar e abrir o menu principal.

source: Choose the task you want to perform
pt_br: Escolha a tarefa que deseja executar

source: Options
pt_br: Opções

source: Simple package conversion (.deb → .xbps)
pt_br: Conversão simples de pacote (.deb → .xbps)

source: Conversion with automatic dependency resolution
pt_br: Conversão com resolução automática de dependências

source: Download dependencies (shlibs)
pt_br: Download de dependências (shlibs)

source: Conversion with shlibs + automatic resolution
pt_br: Conversão com shlibs + resolução automática

source: Add dependencies manually
pt_br: Adicionar dependências manualmente

source: Remove temporary files
pt_br: Remover arquivos temporários

source: Remove only repodata (rebuild)
pt_br: Remover apenas repodata (rebuild)

source: Extract .deb without assembling package
pt_br: Extrair .deb sem montar pacote

source: Direct package build from directory
pt_br: Build de pacote direto de diretório

source: Do not register package in repository
pt_br: Não registrar pacote no repositório

source: Add -32bit suffix to package
pt_br: Adicionar sufixo -32bit ao pacote

source: Automatically install after creation
pt_br: Instalar automaticamente após a criação

source: Remove empty directories
pt_br: Remover diretórios vazios

source: Show xdeb version
pt_br: Mostrar versão do xdeb

source: Show xdeb help
pt_br: Mostrar ajuda do xdeb

source: Exit
pt_br: Sair

source: Select the .deb package
pt_br: Selecione o pacote .deb

source: Please select a valid .deb file.
pt_br: Selecione um arquivo .deb válido.

source: Conversion completed successfully!
pt_br: Conversão concluída com sucesso!

source: Error converting package.
pt_br: Erro na conversão do pacote.

source: Shlibs download completed successfully!
pt_br: Download de shlibs concluído com sucesso!

source: Error downloading shlibs.
pt_br: Erro ao baixar shlibs.

source: Conversion with dependencies completed successfully!
pt_br: Conversão com dependências concluída com sucesso!

source: Error converting with dependencies.
pt_br: Erro na conversão com dependências.

source: Select the directory with the files
pt_br: Selecione o diretório com os arquivos

source: Direct build completed successfully!
pt_br: Build direto concluído com sucesso!

source: Error running direct build.
pt_br: Erro ao executar o build direto.

source: Conversion completed (no record in repository).
pt_br: Conversão concluída (sem registro no repositório).

source: Error converting with -R.
pt_br: Erro na conversão com -R.

source: Empty directories removed successfully!
pt_br: Diretórios vazios removidos com sucesso!

source: Error removing empty directories.
pt_br: Erro ao remover diretórios vazios.

source: Dependencies
pt_br: Dependências

source: Enter dependencies (e.g. tar>0, gzip, etc.)
pt_br: Digite as dependências (ex: tar>0, gzip, etc)

source: Extraction completed successfully!
pt_br: Extração concluída com sucesso!

source: Error extracting package.
pt_br: Erro na extração do pacote.

source: Temporary files removed successfully!
pt_br: Arquivos temporários removidos com sucesso!

source: Error removing temporary files.
pt_br: Erro ao remover arquivos temporários.

source: Repodata removed successfully.
pt_br: Repodata removida com sucesso.

source: Error removing repodata.
pt_br: Erro ao remover repodata.

source: Installation completed successfully!
pt_br: Instalação concluída com sucesso!

source: Error installing package.
pt_br: Erro na instalação do pacote.

source: xdeb help
pt_br: Ajuda do xdeb

source: Leaving...
pt_br: Saindo...

source: xdeb manual
pt_br: Manual do xdeb

source: Converts using the most commonly used option (xdeb -Sde)
pt_br: Converte usando a opção mais usada (xdeb -Sde)

source: \nIMPORTANT NOTICE:\n\nUsing xdeb to convert .deb packages in Void Linux can cause serious system problems.\nVoid Linux is not compatible with Debian/Ubuntu packages. Libraries, paths, and dependencies may be different or non-existent.\n\nPossible consequences:\n\n- Broken packages and system dependencies\n- Library incompatibility\n- Failures in future updates\n- Compromised system stability\nUse xdeb only in specific cases and with simple, non-critical packages.\n\nRecommendation:\n\nPrefer to install software directly from the official Void repositories (xbps), use Flatpak/AppImage, or compile from source code.\nAre you aware of the risks?
pt_br: AVISO IMPORTANTE:\n\nO uso do xdeb para converter pacotes .deb no Void Linux pode causar sérios problemas ao sistema.\nVoid Linux não é compatível com os pacotes do Debian/Ubuntu. Bibliotecas, caminhos e dependências podem ser diferentes ou inexistentes.\n\nConsequências possíveis:\n\n- Quebra de pacotes e dependências do sistema\n- Incompatibilidade de bibliotecas\n- Falhas em atualizações futuras\n- Comprometimento da estabilidade do sistema\n\nUse xdeb apenas em casos específicos e com pacotes simples e não-críticos.\n\nRecomendação:\n\nPrefira instalar softwares diretamente dos repositórios oficiais do Void (xbps), usar Flatpak/AppImage, ou compilar do código-fonte.\n\nVocê está ciente dos riscos?

source: Cancel
pt_br: Cancelar

source: Missing dependencies
pt_br: Dependências ausentes

source: Close
pt_br: Fechar

source: The log file will be saved to: %s It is recommended to check after each package conversion.
pt_br: O arquivo de log será salvo em: %s É recomendável verificar após cada conversão de pacote.

source: The following commands are not installed: %s You can install them with: sudo xbps-install -Sy %s
pt_br: Os seguintes comandos não estão instalados: %s Você pode instalá-los com: sudo xbps-install -Sy %s

source: xdeb version: %s
pt_br: Versão do xdeb: %s

source: grep does NOT support -P.
pt_br: grep NÃO tem suporte a -P.

source: This script requires bash. Exiting...
pt_br: Este script requer bash. Saindo...

source: Error: Destination directory '%s' already exists and is NOT empty.
pt_br: Erro: diretório de destino '%s' já existe e NÃO está vazio.

source: Error: No read/write permission on: %s Tip: Run the command with administrator privileges (e.g. using sudo), or change the directory permissions:
pt_br: Erro: Sem permissão de leitura/gravação em: %s Dica: Execute o comando com privilégios de administrador (por exemplo, usando sudo) ou altere as permissões do diretório:

source: or
pt_br: ou

source: Man page for xdeb not found.
pt_br: Página de manual para xdeb não encontrada.

source: Yad is not installed... Install with: sudo xbps-install -Sy yad
pt_br: O yad não esta instalado... Instale com: sudo xbps-install -Sy yad

source: The following commands are not installed: %s Please install them before continuing.
pt_br: Os seguintes comandos não estão instalados: %s Por favor, instale-os antes de continuar.

source: Installing files to %s...
pt_br: Instalando arquivos em %s...

source: Installation complete.
pt_br: Instalação concluída.

source: Uninstaller
pt_br: Desinstalador

source: Removing file %s...
pt_br: Removendo arquivo %s...

source: Uninstallation complete.
pt_br: Desinstalação concluída.

source: Usage: %s {install|uninstall}
pt_br: Uso: %s {instalar|desinstalar}

source: No internet connection. Unable to sync shlibs.
pt_br: Sem conexão com a internet. Não foi possível sincronizar shlibs.

source: Errors occurred earlier. Aborting before package creation or installation.
pt_br: Erros ocorreram anteriormente. Interrupção antes da criação ou instalação do pacote.

source: Warning:
pt_br: Aviso:

source: One or more required shared libraries are missing.
pt_br: Uma ou mais bibliotecas compartilhadas obrigatórias estão ausentes.

source: You may need to install the appropriate packages or adjust your dependencies.
pt_br: Você pode precisar instalar os pacotes apropriados ou ajustar suas dependências.

source: Use `--deps=...` or install missing libraries before proceeding.
pt_br: Use `--deps=...` ou instale as bibliotecas ausentes antes de continuar.

source: Missing libraries found. Aborting package creation to avoid broken installs.
pt_br: Bibliotecas ausentes encontradas. Abortando a criação do pacote para evitar instalações interrompidas.

source: Error installing package: %s
pt_br: Erro ao instalar o pacote: %s

source: Missing library:
pt_br: Biblioteca ausente:

source: not found
pt_br: não encontrado

source: in binary
pt_br: em binário

source: 🧩 Workarounds: * Repackage the program as a Void package (.xbps) with adjusted dependencies. In Void Linux, you have several ways to install programs, each with its own advantages depending on your usage style and needs. Here are the main ones: 1. Using the xbps package manager xbps-install -S package-name 2. Compiling with xtools (build from source) xbps-install -S xtools git clone https://github.com/void-linux/void-packages cd void-packages ./xbps-src binary-bootstrap ./xbps-src pkg package-name xbps-install --repository=hostdir/binpkgs package-name 3. Install .xbps packages manually using xbps-install If you have a local .xbps package. 4. Flatpak (sandboxed apps) Flatpak works well in Void and allows you to install universal apps: xbps-install -S flatpak flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo flatpak install flathub name.of.app 5. Docker (containers) xbps-install -S docker 6.AppImage chmod +x program.AppImage ./programa.AppImage 7. Manual: compile from source git clone https://github.com/algo/projeto.git project cd make && sudo make install
pt_br: 🧩 Soluções alternativas: * Reempacotar o programa como um pacote Void (.xbps) com dependências ajustadas. No Void Linux, você tem várias formas de instalar programas, cada uma com suas vantagens dependendo do seu estilo de uso e necessidade. Aqui estão as principais: 1. Usando o gerenciador de pacotes xbps xbps-install -S nome-do-pacote 2. Compilando com xtools (build do source) xbps-install -S xtools git clone https://github.com/void-linux/void-packages cd void-packages ./xbps-src binary-bootstrap ./xbps-src pkg nome-do-pacote xbps-install --repository=hostdir/binpkgs nome-do-pacote 3. Instalar pacotes .xbps manualmente usando o xbps-install Se você tiver um pacote .xbps local. 4. Flatpak (sandboxed apps) Flatpak funciona bem no Void e permite instalar apps universais: xbps-install -S flatpak flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo flatpak install flathub nome.do.app 5. Docker (containers) xbps-install -S docker 6. AppImage chmod +x programa.AppImage ./programa.AppImage 7. Manual: compilar do código-fonte git clone https://github.com/algo/projeto.git cd projeto make && sudo make install

source: Error removing
pt_br: Erro ao remover

source: Successfully removed
pt_br: Removido com sucesso

source: No lock file found in
pt_br: Nenhum arquivo de lock encontrado em

source: Ending LibreOffice processes...
pt_br: Finalizando processos do LibreOffice...

source: Lock file(s) found at %s
pt_br: Arquivo(s) de lock encontrado(s) em %s

source: Removendo lock file: %s
pt_br: Removendo arquivo de bloqueio: %s

source: Debian Packages
pt_br: Pacotes Debian

source: Error: Package name not found in control file.
pt_br: Erro: Nome do pacote não encontrado no arquivo control.

source: Missing or incorrectly formatted 'Version' field. Valid example: Version: 1.0
pt_br: Campo 'Version' ausente ou mal formatado. Exemplo válido: Version: 1.0

source: Error: Field 'Architecture' not found in control file.
pt_br: Erro: Campo 'Architecture' não encontrado no arquivo control.

source: Invalid 'Architecture' value:
pt_br: Valor de 'Architecture' inválido:

source: Use one of the following: all, amd64, i386, arm64, armhf.
pt_br: Use um dos seguintes: all, amd64, i386, arm64, armhf.

source: Error: Field 'Maintainer' not found or empty in control file.
pt_br: Erro: Campo 'Maintainer' não encontrado ou vazio no arquivo control.

source: Invalid 'Maintainer' format. Use: Name <email@domain>
pt_br: Formato de 'Maintainer' inválido. Use: Nome <email@dominio>

source: The selected file does not appear to be a valid .deb package.
pt_br: O arquivo selecionado não parece ser um pacote .deb válido.

source: .deb file appears valid.
pt_br: Arquivo .deb parece válido.

source: Invalid .deb file!
pt_br: Arquivo .deb inválido!
